/* Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 */`

/*
void SecondNum(int number)
{
    if (number > 99 && number < 1000)
    {
        int newnum = (number % 100)  / 10; 
        Console.WriteLine($"Вторая цифра числа {number}: {newnum}");
    }
    else
    {
        Console.WriteLine("Число не трёхзначное, повторите попытку используя трёхзначное число!"); 
    }
}

Console.WriteLine("Bведите трёхзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());
SecondNum(number);
*/


/*Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5
78 -> третьей цифры нет
32679 -> 6 */



/*Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет */


